In [1]:
import pandas as pd
import sqlite3
import os
os.getcwd()

'C:\\Users\\makim\\Python_project'

In [2]:
df1 = pd.read_csv("WeatherInTokyo.csv")
df1.head(20)

# create the sqlite DB
db = sqlite3.connect("WeatherTokyo.db")

# convert the pandas dataframe to a sqlite table
df1.to_sql("weather", db, if_exists="replace")

# view dataframe
# df1
query = ''' 
SELECT * 
FROM weather'''
pd.read_sql_query(query,db)

C:\Users\makim\Anaconda3\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

,index,date,condition,high_temp (° F),low_temp (° F),day_length,sun_rise,sun_set
0,0,Oct 21st 2019,Cloudy,61,54,11h 7m,5:52 AM,5:00 PM
1,1,Oct 22nd 2019,Rain,64,59,11h 5m,5:53 AM,4:59 PM
2,2,Oct 23rd 2019,Fair,63,54,11h 3m,5:54 AM,4:58 PM
3,3,Oct 24th 2019,Cludy,70,63,11h 1m,5:55 AM,4:57 PM
4,4,Oct 25th 2019,Rain,63,57,10h 59m,5:56 AM,4:55 PM
5,5,Oct 26th 2019,Cloudy,64,55,10h 57m,5:57 AM,4:54 PM
6,6,Oct 27th 2019,Cludy,64,55,10h 55m,5:58 AM,4:53 PM
7,7,Nov 22th 2019,rain,64,55,10h 57m,5:57 AM,4:54 PM
8,8,Nov 17th 2019,Cludy,64,55,10h 55m,5:58 AM,4:53 PM

In [3]:
query = '''
SELECT * 
FROM weather
WHERE "high_temp (° F)" <= 63;

'''

pd.read_sql_query(query,db)

,index,date,condition,high_temp (° F),low_temp (° F),day_length,sun_rise,sun_set
0,0,Oct 21st 2019,Cloudy,61,54,11h 7m,5:52 AM,5:00 PM
1,2,Oct 23rd 2019,Fair,63,54,11h 3m,5:54 AM,4:58 PM
2,4,Oct 25th 2019,Rain,63,57,10h 59m,5:56 AM,4:55 PM

In [4]:
query = '''
SELECT REPLACE("condition", "Cludy", "Cloudy") FROM weather;
'''
pd.read_sql_query(query,db)

  REPLACE("condition", "Cludy", "Cloudy")
0                                  Cloudy
1                                    Rain
2                                    Fair
3                                  Cloudy
4                                    Rain
5                                  Cloudy
6                                  Cloudy
7                                    rain
8                                  Cloudy

In [5]:
query = '''
SELECT REPLACE("condition", "rain", "Rain") FROM weather;
'''
pd.read_sql_query(query,db)

  REPLACE("condition", "rain", "Rain")
0                               Cloudy
1                                 Rain
2                                 Fair
3                                Cludy
4                                 Rain
5                               Cloudy
6                                Cludy
7                                 Rain
8                                Cludy

In [26]:
query = '''
SELECT AVG("high_temp (° F)") FROM  weather;
'''
pd.read_sql_query(query,db)

   AVG("high_temp (° F)")
0               64.111111

In [21]:
pd.read_sql_query("""select avg("index") from weather""",db)

   avg("index")
0           4.0

In [27]:
query = '''
SELECT AVG("low_temp (° F)") FROM  weather;
'''
pd.read_sql_query(query,db)

   AVG("low_temp (° F)")
0              56.333333